[
  {
    "title": "About Indian Institute of Technology Bhilai",
    "description": "Established in 2016, the Indian Institute of Technology Bhilai (IIT Bhilai) is one of the newer institutions in the prestigious IIT system, strategically located in Chhattisgarh. The institute was founded to improve excellence in engineering education, research, and technological innovation. Situated near the industrial city of Bhilai, the campus offers a unique advantage by providing students with close proximity to various industries, facilitating practical learning and industry exposure. IIT Bhilai is committed to providing a vibrant campus life, encouraging students to participate in a wide range of extracurricular activities, including sports, cultural events, and technical clubs, thus promoting holistic development alongside rigorous academic pursuits.",
    "imageSrc": "/images/organizing_institutes/iitbh_logo.png"
  },
  {
    "title": "About Villa College, Maldives",
    "description": "Villa College is the first private higher education institution of the Maldives. In 2007, it was founded by Hon. Dr. Qasim Ibrahim, Chairman of the Villa group, through the Private-Public Partnership Agreement with the government. In 2015, a new partnership with the University of the West of England (UWE) was established, which has proved to be the most fruitful partnership for the College. Since then, the College has signed to collaborate with numerous universities, the most recent most significant one being the agreement signed with Taylor’s University, which will introduce Culinary Arts as a new field of studies offered by Villa College. In the last few years, the variety of programs Villa College offers has expanded immensely, offering programs from high-demand areas such as Master’s in Counselling, and also offering programs from niche areas such as Art and Design.",
    "imageSrc": "/images/organizing_institutes/villa_college.webp"
  },
  {
    "title": "About St. Mother Theresa Engineering College",
    "description": "St. Mother Theresa Engineering College, popularly known as SMTEC, was established in the year 2009 with the vision to empower budding engineers in technical and entrepreneurial training and to contribute to the socio-economic augmentation of the nation. The campus is self-sustained with all the modern facilities required for quality Engineering Education, Upgraded Laboratories, Smart Classroom, Excellent Library Facility. The college offers a plethora of options for students to develop their talents, and it methodically turns graduates into professionals who are prepared for the future. The organization fosters an environment that is open to the sharing of ideas and supports the growth of individuals as well as professionals.",
    "imageSrc": "/images/organizing_institutes/mother-teressa-college.png"
  }
]