[
  {
    "id": 1,
    "title": "Unlocking the Secrets of Quantum Computing in Material Science",
    "slug": "quantum-computing-material-science",
    "date": "2025-06-28",
    "author": "Dr. Anya Sharma",
    "image": "https://placehold.co/600x400/4A90E2/FFFFFF?text=Quantum+Computing",
    "excerpt": "Our latest research explores how quantum computing can revolutionize material science, enabling the discovery of novel materials with unprecedented properties. Dive into the potential of quantum algorithms for simulating complex molecular structures and predicting their behavior."
  },
  {
    "id": 2,
    "title": "Sustainable Energy Solutions: The Future of Perovskite Solar Cells",
    "slug": "perovskite-solar-cells",
    "date": "2025-06-20",
    "author": "Prof. Rajeev Kumar",
    "image": "https://placehold.co/600x400/38B2AC/FFFFFF?text=Solar+Cells",
    "excerpt": "Perovskite solar cells are emerging as a game-changer in renewable energy. This post delves into our group's efforts to enhance their efficiency, stability, and scalability, paving the way for widespread adoption of affordable solar power."
  },
  {
    "id": 3,
    "title": "Advancements in AI for Early Disease Detection: A Deep Learning Approach",
    "slug": "ai-disease-detection",
    "date": "2025-06-15",
    "author": "Dr. Lena Petrova",
    "image": "https://placehold.co/600x400/E53E3E/FFFFFF?text=AI+Diagnosis",
    "excerpt": "Artificial intelligence is transforming healthcare. We discuss our pioneering work in developing deep learning models that can detect diseases at their earliest stages, offering new hope for timely interventions and improved patient outcomes."
  },
  {
    "id": 4,
    "title": "Exploring the Nanoscale: Innovations in Self-Assembling Materials",
    "slug": "nanoscale-materials",
    "date": "2025-06-05",
    "author": "Dr. Kenji Tanaka",
    "image": "https://placehold.co/600x400/D08770/FFFFFF?text=Nanomaterials",
    "excerpt": "The world of nanotechnology holds immense promise. This article highlights our breakthroughs in designing self-assembling materials that can form complex structures at the nanoscale, with applications ranging from advanced electronics to targeted drug delivery."
  }
]
